In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.array(['a','b','c','d'])

In [3]:
 s=pd.Series(data,index=[100,101,102,103])

In [4]:
s

100    a
101    b
102    c
103    d
dtype: object

In [5]:
ser1 = pd.Series([1,2,3,4], index = ["USA", "Germany", "USSR", "Japan"])
ser2 = pd.Series([1,2,5,4], index = ["USA", "Germany", "Italy", "Japan"])

In [8]:
ser3=ser1+ser2

In [9]:
ser3

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [11]:
ser3["Italy":"USSR"]=888

In [12]:
ser3

Germany      4.0
Italy      888.0
Japan      888.0
USA        888.0
USSR       888.0
dtype: float64

In [14]:
tarihler=pd.date_range('20130101', periods=3,
                        tz='US/Eastern')

In [15]:
tarihler

DatetimeIndex(['2013-01-01 00:00:00-05:00', '2013-01-02 00:00:00-05:00',
               '2013-01-03 00:00:00-05:00'],
              dtype='datetime64[ns, US/Eastern]', freq='D')

In [16]:
dateSeri=pd.Series(tarihler)

In [17]:
dateSeri

0   2013-01-01 00:00:00-05:00
1   2013-01-02 00:00:00-05:00
2   2013-01-03 00:00:00-05:00
dtype: datetime64[ns, US/Eastern]

In [18]:
s = pd.Series(['lama', 'cow', 'lama', 'beetle', 'lama','hippo'], name='animal')

In [19]:
s

0      lama
1       cow
2      lama
3    beetle
4      lama
5     hippo
Name: animal, dtype: object

In [21]:
bool2=s.isin(["lama"])

In [22]:
s[bool2]

0    lama
2    lama
4    lama
Name: animal, dtype: object

In [23]:
a = pd.Series([1, 1, 1, np.nan], index=['a', 'b', 'c', 'd'])
b = pd.Series([1, np.nan, 1, np.nan], index=['a', 'b', 'd', 'e'])

In [24]:
a

a    1.0
b    1.0
c    1.0
d    NaN
dtype: float64

In [25]:
b

a    1.0
b    NaN
d    1.0
e    NaN
dtype: float64

In [27]:
a.add(b,fill_value=0)

a    2.0
b    1.0
c    1.0
d    1.0
e    NaN
dtype: float64

In [29]:
s = pd.Series([20, 21, 12],
              index=['London', 'New York', 'Helsinki'])

In [30]:
s

London      20
New York    21
Helsinki    12
dtype: int64

In [31]:
def bincarp(x):
    return x*1000

In [32]:
s.apply(bincarp)

London      20000
New York    21000
Helsinki    12000
dtype: int64

In [33]:
s = pd.Series([1, 2, 3, 4])

In [34]:
s.agg(["min", "max","sum"])

min     1
max     4
sum    10
dtype: int64

In [35]:
s.transform([np.sqrt,np.sin])

       sqrt       sin
0  1.000000  0.841471
1  1.414214  0.909297
2  1.732051  0.141120
3  2.000000 -0.756802

In [36]:
ser = pd.Series([390., 350., 30., 20.],index=['Falcon', 'Falcon', 'Parrot', 'Parrot'], name="Max Speed")

In [37]:
ser

Falcon    390.0
Falcon    350.0
Parrot     30.0
Parrot     20.0
Name: Max Speed, dtype: float64

In [38]:
ser.groupby(level=0).mean()

Falcon    370.0
Parrot     25.0
Name: Max Speed, dtype: float64

In [39]:
listem = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild']]

In [41]:
index=pd.MultiIndex.from_arrays(listem, names=["animal", "type"])

In [42]:
ser1=pd.Series([390., 350., 30., 20.], index=index)

In [43]:
ser1

animal  type
Falcon  Captive    390.0
        Wild       350.0
Parrot  Captive     30.0
        Wild        20.0
dtype: float64

In [44]:
ser1.groupby(level=0).mean()

animal
Falcon    370.0
Parrot     25.0
dtype: float64

In [45]:
ser1.groupby(level=1).mean()

type
Captive    210.0
Wild       185.0
dtype: float64

In [46]:
ser1.describe()

count      4.000000
mean     197.500000
std      199.895806
min       20.000000
25%       27.500000
50%      190.000000
75%      360.000000
max      390.000000
dtype: float64

In [47]:
seri=pd.Series(np.arange(3), index=["a", "b","c"])

In [49]:
seri

a    0
b    1
c    2
dtype: int32

In [52]:
seri.drop(labels=["b", "c"], inplace=True)

In [53]:
seri

a    0
dtype: int32

In [54]:
seri

a    0
dtype: int32

In [55]:
ser1

animal  type
Falcon  Captive    390.0
        Wild       350.0
Parrot  Captive     30.0
        Wild        20.0
dtype: float64

In [56]:
ser1.drop(labels="Falcon")

animal  type
Parrot  Captive    30.0
        Wild       20.0
dtype: float64

In [59]:
ser1.drop(labels="Wild", level=1)

AssertionError: axis must be a MultiIndex

DATAFRAME

In [63]:
df=pd.DataFrame([1,5,6,9], index=["a", "b","a", "b"], columns=["type"])

In [64]:
df

   type
a     1
b     5
a     6
b     9

In [65]:
dicti={"name":["Ali", "Veli"], "age":[25,30]}

In [69]:
df2=pd.DataFrame(dicti, index=["a", "b"])

In [70]:
df2

   name  age
a   Ali   25
b  Veli   30

In [71]:
data=[{"a":1, "b":2},{"a":1, "c":5, "d":10}]

In [72]:
df3=pd.DataFrame(data)

In [73]:
df3

   a    b    c     d
0  1  2.0  NaN   NaN
1  1  NaN  5.0  10.0

In [74]:
df4=pd.DataFrame(data, columns=["a", "d"])

In [75]:
df4

   a     d
0  1   NaN
1  1  10.0

In [78]:
df5=pd.DataFrame(np.array([[1,5,8],[1,3,6]]), columns=["a", "b","c"])

In [79]:
df5

   a  b  c
0  1  5  8
1  1  3  6

In [80]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

In [81]:
df5=pd.DataFrame(d)

In [83]:
df5

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [86]:
df6=pd.DataFrame(np.random.randn(7,3), columns=["a", "b","c"])

In [87]:
df6

          a         b         c
0  0.360629 -1.051777 -1.238864
1  0.396278 -2.532568  0.939597
2 -0.628508 -1.446704 -0.894706
3 -2.952058  0.711522  1.051190
4 -0.993133  0.809695 -1.398403
5  0.816356  0.701057  1.482516
6 -0.861705 -0.638739  0.186655

In [89]:
N=20
df7=pd.DataFrame(

{"tarih":pd.date_range("2021-01-01", periods=N, freq="D" ),
"Lineer":np.linspace(0,N-1, num=N),
 "Rasgele":np.random.rand(N),
 "Nem": np.random.choice(["LOW", "MEDIUM", "HIGH"],N).tolist(),
 "XX": np.random.normal(100,10, size=(N)).tolist()
}
)

In [90]:
df7

        tarih  Lineer   Rasgele     Nem          XX
0  2021-01-01     0.0  0.481871  MEDIUM  109.763993
1  2021-01-02     1.0  0.387030    HIGH   99.280547
2  2021-01-03     2.0  0.638462    HIGH   89.780439
3  2021-01-04     3.0  0.126661     LOW   81.471167
4  2021-01-05     4.0  0.553787    HIGH  103.769915
5  2021-01-06     5.0  0.496903  MEDIUM   96.981934
6  2021-01-07     6.0  0.957669     LOW  106.155699
7  2021-01-08     7.0  0.544099     LOW  101.208782
8  2021-01-09     8.0  0.524726    HIGH  109.361708
9  2021-01-10     9.0  0.173775     LOW  114.267585
10 2021-01-11    10.0  0.746130     LOW  100.967459
11 2021-01-12    11.0  0.819597     LOW   93.340942
12 2021-01-13    12.0  0.738566  MEDIUM  103.454110
13 2021-01-14    13.0  0.160494  MEDIUM   98.309123
14 2021-01-15    14.0  0.449369    HIGH   84.752294
15 2021-01-16    15.0  0.875023    HIGH   96.856954
16 2021-01-17    16.0  0.104674  MEDIUM  111.152557
17 2021-01-18    17.0  0.273968  MEDIUM  111.420130
18 2021-01-19    18.0  0.505964     LOW  119.679006
19 2021-01-20    19.0  0.150828  MEDIUM  126.055706

In [91]:
df7.tail(3)

        tarih  Lineer   Rasgele     Nem          XX
17 2021-01-18    17.0  0.273968  MEDIUM  111.420130
18 2021-01-19    18.0  0.505964     LOW  119.679006
19 2021-01-20    19.0  0.150828  MEDIUM  126.055706

In [92]:
df7.shape

(20, 5)

In [93]:
df7.ndim

2

In [95]:
df7.head(10)

       tarih  Lineer   Rasgele     Nem          XX
0 2021-01-01     0.0  0.481871  MEDIUM  109.763993
1 2021-01-02     1.0  0.387030    HIGH   99.280547
2 2021-01-03     2.0  0.638462    HIGH   89.780439
3 2021-01-04     3.0  0.126661     LOW   81.471167
4 2021-01-05     4.0  0.553787    HIGH  103.769915
5 2021-01-06     5.0  0.496903  MEDIUM   96.981934
6 2021-01-07     6.0  0.957669     LOW  106.155699
7 2021-01-08     7.0  0.544099     LOW  101.208782
8 2021-01-09     8.0  0.524726    HIGH  109.361708
9 2021-01-10     9.0  0.173775     LOW  114.267585

In [96]:
df7.axes

[RangeIndex(start=0, stop=20, step=1),
 Index(['tarih', 'Lineer', 'Rasgele', 'Nem', 'XX'], dtype='object')]

In [97]:
df7.values

array([[Timestamp('2021-01-01 00:00:00'), 0.0, 0.4818710698310066,
        'MEDIUM', 109.76399261271128],
       [Timestamp('2021-01-02 00:00:00'), 1.0, 0.38703043084648714,
        'HIGH', 99.28054694844492],
       [Timestamp('2021-01-03 00:00:00'), 2.0, 0.6384620071818322,
        'HIGH', 89.78043864079382],
       [Timestamp('2021-01-04 00:00:00'), 3.0, 0.1266613465937051, 'LOW',
        81.47116731603288],
       [Timestamp('2021-01-05 00:00:00'), 4.0, 0.5537873260586236,
        'HIGH', 103.76991490397683],
       [Timestamp('2021-01-06 00:00:00'), 5.0, 0.49690253638151183,
        'MEDIUM', 96.98193392756596],
       [Timestamp('2021-01-07 00:00:00'), 6.0, 0.9576689081610017, 'LOW',
        106.15569893616068],
       [Timestamp('2021-01-08 00:00:00'), 7.0, 0.5440992924804763, 'LOW',
        101.20878153914664],
       [Timestamp('2021-01-09 00:00:00'), 8.0, 0.5247264856831977,
        'HIGH', 109.36170810889416],
       [Timestamp('2021-01-10 00:00:00'), 9.0, 0.17377540607757214,
        'LOW', 114.26758547519727],
       [Timestamp('2021-01-11 00:00:00'), 10.0, 0.7461304040643048,
        'LOW', 100.96745876767302],
       [Timestamp('2021-01-12 00:00:00'), 11.0, 0.8195968191124516,
        'LOW', 93.34094245239768],
       [Timestamp('2021-01-13 00:00:00'), 12.0, 0.7385660264626677,
        'MEDIUM', 103.45410957464502],
       [Timestamp('2021-01-14 00:00:00'), 13.0, 0.1604942635797335,
        'MEDIUM', 98.3091234203561],
       [Timestamp('2021-01-15 00:00:00'), 14.0, 0.4493693143938008,
        'HIGH', 84.75229444100844],
       [Timestamp('2021-01-16 00:00:00'), 15.0, 0.875022561195983,
        'HIGH', 96.85695352382356],
       [Timestamp('2021-01-17 00:00:00'), 16.0, 0.10467378619000844,
        'MEDIUM', 111.15255720330417],
       [Timestamp('2021-01-18 00:00:00'), 17.0, 0.2739683542620077,
        'MEDIUM', 111.42013028044141],
       [Timestamp('2021-01-19 00:00:00'), 18.0, 0.5059636988447047,
        'LOW', 119.67900612327065],
       [Timestamp('2021-01-20 00:00:00'), 19.0, 0.15082825758842655,
        'MEDIUM', 126.05570589702977]], dtype=object)

In [98]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   tarih    20 non-null     datetime64[ns]
 1   Lineer   20 non-null     float64
 2   Rasgele  20 non-null     float64
 3   Nem      20 non-null     object
 4   XX       20 non-null     float64
dtypes: datetime64[ns](1), float64(3), object(1)
memory usage: 928.0+ bytes

In [99]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot','Falcon', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild','Captive', 'Wild']]
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
ser = pd.Series([390., 350., 30., 20.,30., 20.], index=index, name="Max Speed")

In [101]:
ser

Animal  Type
Falcon  Captive    390.0
        Wild       350.0
Parrot  Captive     30.0
        Wild        20.0
Falcon  Captive     30.0
Parrot  Wild        20.0
Name: Max Speed, dtype: float64

In [100]:
ser["Falcon"].groupby(level=0).mean()

Type
Captive    210.0
Wild       350.0
Name: Max Speed, dtype: float64

Column  Addition

In [103]:
df7.head()

       tarih  Lineer   Rasgele     Nem          XX
0 2021-01-01     0.0  0.481871  MEDIUM  109.763993
1 2021-01-02     1.0  0.387030    HIGH   99.280547
2 2021-01-03     2.0  0.638462    HIGH   89.780439
3 2021-01-04     3.0  0.126661     LOW   81.471167
4 2021-01-05     4.0  0.553787    HIGH  103.769915

In [106]:
type(df7["tarih"])

pandas.core.series.Series

In [107]:
df7.tarih

0    2021-01-01
1    2021-01-02
2    2021-01-03
3    2021-01-04
4    2021-01-05
5    2021-01-06
6    2021-01-07
7    2021-01-08
8    2021-01-09
9    2021-01-10
10   2021-01-11
11   2021-01-12
12   2021-01-13
13   2021-01-14
14   2021-01-15
15   2021-01-16
16   2021-01-17
17   2021-01-18
18   2021-01-19
19   2021-01-20
Name: tarih, dtype: datetime64[ns]

In [108]:
N=20
df7=pd.DataFrame(

{"tarih  bilgisi":pd.date_range("2021-01-01", periods=N, freq="D" ),
"Lineer":np.linspace(0,N-1, num=N),
 "Rasgele":np.random.rand(N),
 "Nem": np.random.choice(["LOW", "MEDIUM", "HIGH"],N).tolist(),
 "XX": np.random.normal(100,10, size=(N)).tolist()
}
)

In [115]:
df7.XX.head(2)

0     98.118514
1    109.966389
Name: XX, dtype: float64

In [116]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

In [117]:
df11=pd.DataFrame(d)

In [118]:
df11

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [120]:
df11["toplam"]=df11.one+df11["two"]

In [121]:
df11

   one  two  toplam
a  1.0    1     2.0
b  2.0    2     4.0
c  3.0    3     6.0
d  NaN    4     NaN

In [122]:
df11["yars"]=(df11.one+df11.two)/2

In [123]:
df11

   one  two  toplam  yars
a  1.0    1     2.0     1.0
b  2.0    2     4.0     2.0
c  3.0    3     6.0     3.0
d  NaN    4     NaN     NaN

In [124]:
data={"name":pd.Series(["ali", "aye", "fatma", "mehmet"]), "yas":pd.Series([25,30,35,40]), "kilo":pd.Series([70,55, 60, 80])}

In [125]:
df12=pd.DataFrame(data)

In [127]:
df12["oran"]=df12.yas/df12.kilo

In [128]:
df12

     name  yas  kilo      oran
0     ali   25    70  0.357143
1    aye   30    55  0.545455
2   fatma   35    60  0.583333
3  mehmet   40    80  0.500000

In [ ]:
1.55 x 1.55 = 2.4025
90 / 2.4025 = 37.4

In [129]:
data={"name":pd.Series(["ali", "aye", "fatma", "mehmet"]), "boy":pd.Series([1.70,1.55,1.60,1.90]), "kilo":pd.Series([70,55, 60, 80])}

In [131]:
df=pd.DataFrame(data)

In [132]:
df["beden kitele Endeksi"]=df.kilo/(df.boy**2)

In [133]:
df

     name   boy  kilo  beden kitele Endeksi
0     ali  1.70    70             24.221453
1    aye  1.55    55             22.892820
2   fatma  1.60    60             23.437500
3  mehmet  1.90    80             22.160665

In [135]:
del df["name"]

In [136]:
df

    boy  kilo  beden kitele Endeksi
0  1.70    70             24.221453
1  1.55    55             22.892820
2  1.60    60             23.437500
3  1.90    80             22.160665

In [137]:
df

    boy  kilo  beden kitele Endeksi
0  1.70    70             24.221453
1  1.55    55             22.892820
2  1.60    60             23.437500
3  1.90    80             22.160665

In [138]:
df.pop("boy")

0    1.70
1    1.55
2    1.60
3    1.90
Name: boy, dtype: float64

In [139]:
df

   kilo  beden kitele Endeksi
0    70             24.221453
1    55             22.892820
2    60             23.437500
3    80             22.160665

In [142]:
df.T

                              0         1        2          3
kilo                  70.000000  55.00000  60.0000  80.000000
beden kitele Endeksi  24.221453  22.89282  23.4375  22.160665

In [143]:
df.transpose()

                              0         1        2          3
kilo                  70.000000  55.00000  60.0000  80.000000
beden kitele Endeksi  24.221453  22.89282  23.4375  22.160665

In [147]:
for i in df.columns:
    print(i)

kilo
beden kitele Endeksi

In [149]:
import pandas as pd
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}
df = pd.DataFrame(weather_data)

In [150]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [155]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      object
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [156]:
df["rzgar"]=df.temperature+df.windspeed

In [157]:
df

        day  temperature  windspeed  event  rzgar
0  1/1/2017           32          6   Rain      38
1  1/2/2017           35          7  Sunny      42
2  1/3/2017           28          2   Snow      30
3  1/4/2017           24          7   Snow      31
4  1/5/2017           32          4   Rain      36
5  1/6/2017           31          2  Sunny      33

In [160]:
bigDf=pd.DataFrame({
    "col1":np.random.choice(["a","b","c"], 10**6),
    "col2":np.random.choice(["a","b","c"], 10**6),
    "col3":np.random.choice(["a","b","c"], 10**6)    
})

In [162]:
bigDf.head()

  col1 col2 col3
0    c    c    c
1    c    c    b
2    a    a    c
3    b    a    b
4    a    c    a

In [165]:
bigDf.col1.value_counts()

b    334373
a    332931
c    332696
Name: col1, dtype: int64

In [166]:
bigDf.describe()

           col1     col2     col3
count   1000000  1000000  1000000
unique        3        3        3
top           b        b        c
freq     334373   333908   333845

In [168]:
bigDf[bigDf.isin(["a", "t"])]

       col1 col2 col3
0       NaN  NaN  NaN
1       NaN  NaN  NaN
2         a    a  NaN
3       NaN    a  NaN
4         a  NaN    a
...     ...  ...  ...
999995  NaN  NaN  NaN
999996    a  NaN    a
999997  NaN    a    a
999998  NaN  NaN  NaN
999999  NaN  NaN  NaN

[1000000 rows x 3 columns]

In [169]:
df15=pd.DataFrame(np.arange(10).reshape(-1,2), columns=["a", "b"])

In [183]:
np.arange(10).reshape(5,2)

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7],
       [8, 9]])

In [180]:
df15.shape

(5, 2)

In [172]:
kural=df15%2!=0

In [173]:
kural

       a     b
0  False  True
1  False  True
2  False  True
3  False  True
4  False  True

In [174]:
df15[kural]

    a  b
0 NaN  1
1 NaN  3
2 NaN  5
3 NaN  7
4 NaN  9

In [179]:
df15.where(kural,df15+10000)

       a  b
0  10000  1
1  10002  3
2  10004  5
3  10006  7
4  10008  9

In [184]:
df15

   a  b
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [185]:
df15.agg(["min", "max", "sum"])

      a   b
min   0   1
max   8   9
sum  20  25

In [186]:
df15

   a  b
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [188]:
df15.add_prefix("stun_")

   stun_a  stun_b
0        0        1
1        2        3
2        4        5
3        6        7
4        8        9